// الملف ده نقدر نعتبره "سلك التليفون" أو "حلقة الوصل" اللي بيربط الموقع بتاعنا كله بقاعدة البيانات (اللي اسمها Supabase).
// من غير الملف ده، الموقع مش هيعرف يخزن بيانات الطلاب ولا الغرف ولا يقراها.

// هنا بنجيب أداة مخصصة اسمها createClient من جوه مكتبة supabase.
// الأداة دي عامله زي "السنترال"، هي اللي بتاخد العنوان والباسورد وتفتح خط الاتصال الفعلي بين الموقع وقاعدة البيانات.
import { createClient } from '@supabase/supabase-js'

// السطرين اللي جايين دول معمولين عشان "الأمان والسرية".
// إحنا مش عايزين نكتب رابط قاعدة البيانات والمفتاح السري بتاعها جوه الكود مباشرة عشان أي حد بيقرأ الكود ميشوفهمش ويسرق بياناتنا.
// عشان كده بنخبيهم في ملف سري ومقفول اسمه (.env).
// الأمر import.meta.env ده هو الطريقة اللي بنخلي الكود بيها يروح يقرا الحاجات المستخبية في الملف السري ده من غير ما يفضحها هنا.

// هنا بنروح للملف السري ونجيب منه "العنوان أو الرابط" بتاع قاعدة البيانات ونحفظه في مخزن اسمه supabaseUrl.
const supabaseUrl = import.meta.env.VITE_SUPABASE_URL

// وهنا بنروح للملف السري ونجيب منه "المفتاح أو الباسورد" اللي هيسمحلنا ندخل، ونحفظه في مخزن اسمه supabaseAnonKey.
const supabaseAnonKey = import.meta.env.VITE_SUPABASE_ANON_KEY

// السطر ده إحنا كاتبينه للمبرمجين نفسهم مش لليوزر.
// دالة console.log بتطبع رسالة في شاشة المطورين (اللي بتفتح بـ F12 في المتصفح).
// فايدتها إننا نطمن ونتأكد إن الكود قدر يقرأ الرابط بنجاح من الملف السري ومفيش أي مشكلة في الاتصال.
console.log("Supabase URL is:", supabaseUrl);

// دي بقى الخطوة الأخيرة والأهم:
// بنشغل الأداة createClient وبنديها حاجتين: الرابط (supabaseUrl) والمفتاح (supabaseAnonKey).
// الأداة دي بتعمل الاتصال، وإحنا بنحفظ الاتصال ده كله جوه حاجة اسمها supabase.
// وكلمة export في الأول دي معناها "صدّر الاتصال ده"، عشان أي ملف تاني في المشروع (زي صفحة الدخول أو التسجيل) يقدر يعمل import لـ supabase ويستخدمه عشان يكلم قاعدة البيانات علطول.
export const supabase = createClient(supabaseUrl, supabaseAnonKey)